Repository: giellalt/corpus-sme
Catalog: tmx/nob/admin/sd/white_papers/gievrras_giellamodeallat.pdf.tmx
Source language: sme
Languages: nob

source: Bargojoavkku vuođđojurdda ja olles guorahallama vuolggasadji lea leamaš dat, ahte sámegiela produktiivvalaš dáidu galgá leat čielga mihttu sihke mánáidgárddis ja skuvllas.
nob: Arbeidsgruppa har hatt produktive ferdigheter i samisk som grunnprinsipp og utgangspunkt for hele utredningen, og det er nettopp produktive språkferdigheter som skal være målet både i barnehage og skole.

source: Mii leat suokkardallan Baker ja Todal meroštallamiid vuođul, movt buoremusat sirdit ja oahpahit sámegiela ja nannet mánáid sámegiela dáiddu.
nob: Vi har på grunnlag av definisjonene til Baker og Todal vurdert hvordan man på best mulig måte kan overføre samiskkunnskaper, undervise i samisk og styrke barns ferdigheter i samisk.

source: Nugo ovddabealde oidno, sihke Baker ja Todal lokteba guovttegielatvuohta- doahpaga ja guovttegielatvuođa deattuheami problemáhtalažžan unnitlogugiela konteavsttas.
nob: Som allerede nevnt, så problematiserer både Baker og Todal vektlegging av tospråklighetsbegrepet og tospråklighet i en minoritetsspråklig kontekst.

source: Go sámi mánát galget šaddat guovttegielagat, de lea sámegiella dat rašes giella, go fas riikagiella lea diehttelas.
nob: Når samiske barn skal bli tospråklige, da er samisk det utsatte språket, mens riksspråket er en selvfølge.

source: Jus sámi mánát galget šaddat guovttegielagin, de ferte sámegiella leat guovddážis ja deattuhuvvot.
nob: Hvis samiske barn skal bli tospråklige, må samisk være i fokus og vektlegges.

source: Sámi mánáid guovttegielatvuohta danin čatnasa dasa man bures mánáidgárde- ja skuvlavuogádagat lihkostuvvet sámegielain.
nob: Samiske barns tospråklighet er derfor knyttet til hvor godt barnehage- og skolesystemet lykkes med samisk.

source: Dán ášši bargojoavku guorahallá čiekŋaleappot nuppi dokumeanttas.
nob: Dette går arbeidsgruppen nærmere inn på i det andre dokumentet.

source: Bargojoavku oaidná ahte gievrras giellamodeallaid meroštallamis leat guokte beali;
nob: Arbeidsgruppen ser at det er to sider ved definisjonen av sterke språkmodeller;

source: organisatoralaš bealli ja diđolaš giellageavadagat .
nob: organisatoriske forutsetninger og bevisste språkpraksiser .

source: Organisatoralaš gažaldagaide gullet omd. dat, gallii vahkus doaimmat lágiduvvojit;
nob: Organisatoriske forutsetninger omfatter for eksempel regelmessighet i de samiskspråklige aktivitetene, altså hvor mange ganger og hvor ofte aktivitetene arrangeres;

source: leatgo sámegielat doaimmat sierra sámejoavkkus vai stuorit joavkku siste;
nob: arrangeres de samiskspråklige aktivitetene i en egen samisk gruppe eller i en større gruppe;

source: lágiduvvojitgo deaivvadeamit gáiddusoahpahusa lassin.
nob: arrangeres det språktreff i tillegg til fjernundervisning.

source: Giellageavadagaide gullet omd. diđolaš bargu dainna ulbmiliin ahte mánát galget šaddat produktiiva sámegielagin, ahte hábmejuvvo sámegielat ovttagielat biras gos rávisolbmot stivrejit mánáid giellageavaheami, vai sihkkarastet mánáid produktiivvalaš gielladáiddu, ja ahte dát bargu árvvoštallojuvvo.
nob: Språkpraksiser omfatter for eksempel bevisst språkarbeid blant barnehageansatte og lærere for å oppnå at barna blir produktivt samiskspråklige, at man skaper et enspråklig samisk miljø der de voksne styrer barnas språkvalg, for å sikre barnas produktive språkferdigheter, og at dette arbeidet evalueres.

source: Goappaš beliid ferte váldit vuhtii go árvvoštallá doaibmágo dihto fálaldat gievrras giellaoahpahusmodealla mielde.
nob: Både organisatoriske forutsetninger og språkpraksiser må tas hensyn til når man vurderer om et bestemt tilbud fungerer etter modellen for sterk språkopplæring.

source: Fálaldat nappo ii sáhte daddjot gievrras giellamodeallan jus dušše organisatoralaš bealit leat sajis, muhto váilot diđolaš geavadat, omd. ahte ii diđolaččat bargojuvvo dan ovdii ahte mánáide sajáiduvvá sámegiella produktiivvalaš giellan.
nob: Tilbudet kan altså ikke sies å være en sterk språkmodell hvis bare de organisatoriske sidene fungerer, samtidig som det er mangelfulle bevisste språkpraksiser, for eksempel at det ikke jobbes bevisst for at samisk etableres som et produktivt språk hos barna.

source: Gievrras giellamodealla lea gažaldagas dalle go mánáidgárddi dahje skuvlla doaimmat leat organiserejuvvon nu, ahte sámegiella diđolaččat geavahuvvo gulahallama ja oahppama gaskaoapmin, ii dušše objeaktan ráddjejuvvon bottuin.
nob: De organisatoriske sidene og bevisste språkpraksiser diskuteres nærmere i arbeidsgruppas andre dokument. Det er snakk om en sterk språkmodell når barnehagens eller skolens aktiviteter er organisert slik at samisk brukes bevisst som kommunikasjonsspråk, og ikke bare som objekt i avgrensede stunder.

source: Sámegiella lea gulahallama ja oahppama reaidun, ja ulbmilin lea, ahte sámegiella sajáiduvvá gulahallangiellan maiddái mánáid gaskkas.
nob: Samisk er verktøy for kommunikasjon og læring, og målet er at samisk etableres som kommunikasjonsspråk også blant barna.

source: Gievrras giellamodealla ollašuhttin eaktuda mánáidgárddiin ja skuvllain gielladiđolaš áddejumi ja doaibmavugiid.
nob: Realisering av sterke språkmodeller forutsetter språklig bevissthet og bevisste språkpraksiser hos de ansatte i barnehagene og skolene.

source: Gievrras giellamodealla oktan gáibádussan lea dat, ahte fálaldat árvvoštallojuvvo áiggis áigái, vai fuomášuvvo árrat jus fálaldat ii doaimma nu go galggašii, omd. jus mánát eai sámás, vaikko áddejit giela.
nob: Et av kravene for sterke språkmodeller er jevnlig evaluering av tilbudet, slik at det oppdages tidlig hvis tilbudet ikke fungerer etter intensjonen, for eksempel hvis barna ikke snakker samisk, selv om de forstår språket.

source: Árvvoštallama vuođul ferte doaimmaid organisatoralaš beliid ja diđolaš giellageavadagaid ovdánahttit.
nob: På grunnlag av evalueringen skal virksomhetens organisatoriske forutsetninger og språklige praksiser videreutvikles.

source: Geahnohis giellamodealla lea gažaldagas dalle go sámegillii lea várrejuvvon mánáidgárde- dahje skuvlabirrasis hui ráddjejuvvon áigi: giella lea anus dušše sierra doaibmanbottuin dahje giellaoahpahandiimmuin (omd. skuvllas sámegielfágas).
nob: Det er snakk om en svak språkmodell når tiden som settes av til samisk i barnehage- og skolemiljøet er begrenset: språket er i bruk bare i egne aktivitetsstunder eller språkundervisningstimer (for eksempel på skolen i faget samisk).

source: Dalle giella doaibmá oahpahusa objeaktan iige baicca geavahuvvo oahpahusreaidun, dieđu ja gulahallama gaskaoapmin.
nob: Da fungerer språket som objekt og brukes ikke som undervisningsverktøy, eller som virkemiddel for informasjon og kommunikasjon.

source: Muhtin giellafálaldagain skuvllain ja mánáidgárddiin lea sámegielas stuorát sadji go dušše ráddjejuvvon áiggis, muhto fálaldagas barget gielain eahpesystemáhtalaččat, duollet dálle, diđolaš giellageavadiid ja gielladiđolašvuođa haga.
nob: I enkelte språktilbud på skolene og barnehagene har samisk større plass enn bare et begrenset tidsrom, men språkarbeidet er usystematisk og lite regelmessig, med mangelfulle språkpraksiser og språkbevissthet.

source: Diekkár fálaldat 8 gullá geahnohis giellamodeallaide go diđolaš giellageavadat leat seammá dehálaččat go organisatoralaš bealli.
nob: Slike tilbud hører til de svake språkmodellene, fordi de språkbevisste praksisene er like viktige som den organisatoriske delen.

source: 4 Giellamodeallat Sámis
nob: 4 Språkmodeller i Sápmi

source: Dán oasis mii ovdanbuktit giellaoahpahusmodeallaid mat juogo leat anus Sámis, dahje mat berreše leat anus Sámis, ja movt meroštallat daid.
nob: I dette avsnittet presenterer vi språkmodeller som allerede er i bruk i Sápmi, eller som burde brukes i Sápmi, og hvordan disse vurderes.

source: Bargojoavku guorrasa dán barggus daidda evttohusaide maid Jon Todal lea iežas artihkkalis ovdanbuktán.
nob: Arbeidsgruppen slutter seg til de forslagene som Jon Todal har kommet med i sin artikkel.

source: Todal deattuha ahte gievrras giellamodeallaid bajimus giellapolitihkalaš ulbmil lea sámegiela nannen ja sirdin čuovvovaš sohkabulvii.
nob: Todal understreker at de sterke språkmodellenes øverste språkmålsetting er styrking av samisk og overføring av samisk til påfølgende generasjoner.

source: Bargojoavku oaidná ahte dán ferte čielggasmahttit nu, ahte sihke giellapolitihkalaš ulbmil ja beaivválaš gielalaš ulbmil lea mánáid produktiivvalaš sámegielmáhttu.
nob: Arbeidsgruppen ser at dette må tydeliggjøres på den måten at både det språkpolitiske målet og det daglige språklige målet er at barna oppnår produktive samiskkunnskaper.

source: Todal lokte ovdan ahte giellafálaldagaid bistu ja čielga ovddasvástideaddji leat dehálaš kritearat, ja bargojoavku doarju dan.
nob: Todal understreker viktigheten av språktilbudenes kontinuitet og ansvarsplassering, og arbeidsgruppen støtter dette.

source: Jus suohkaniin lea čielga ovddasvástádusjuohku ja plánat sámi giellafálaldagaide, de lea álkit lihkostuvvat sirdimis sámegiela mánáide.
nob: Hvis kommunene har en klar ansvarsfordeling og planer for språktilbudene, er det enklere å lykkes med overføring av samisk til barna.

source: Lassin Todala ja Bakera kriteraide de lea bargojoavku lasihan ovtta kriteara giellaoahpahusmodeallaid meroštallamii:
nob: I tillegg til Todals og Bakers kriterier, har arbeidsgruppen lagt til ett kriterium til definisjonen av språkopplæringsmodellene:

source: Diđolaš giellageavadat ja árvvoštallan leat dehálaš fáktorat giellamodeallain.
nob: Bevisste språkpraksiser og vurdering er viktige faktorer i språkmodellene.

source: Diđolaš giellageavadat mearkkašit ahte dihtomielalaččat bargojuvvo dainna ulbmiliin ahte 1) ceggejuvvo ovttagielat sámegielat biras mas rávisolbmot diđoštit iežaset giellageavaheami ja stivrejit mánáid giellageavaheami ja 2) mánát galget šaddat produktiivvalaččat sámegielagin, nappo sámástit aktiivvalaččat ja spontánalaččat.
nob: Bevisste språkpraksiser betyr at det jobbes bevisst med det mål at 1) det opprettes et enspråklig samisk miljø hvor voksne er bevisst sin språkbruk og styrer barns språkbruk og 2) barn skal bli produktive samiskspråklige, som snakker samisk aktivt og spontant.

source: Diđolašvuođa hárrái leat ee. čuovvovaš áššit deaŧalaččat: buot mánáid gielladuogáža vuhtiiváldin;
nob: Når det gjelder bevissthet, er blant annet følgende hensyn viktige: alle barns språkbakgrunn;

source: systemáhtalaš giellaválljen;
nob: systematisk språkvalg;

source: gielalaš ulbmiliid hárrái bures plánejuvvon doaimmat;
nob: språkaktiviteter planlagt i forhold til de språklige målene;

source: gielalaš doarjaga fállan mánáide ja bargiide;
nob: tilbud om språklig støtte til barna og de ansatte;

source: gielaid ja giellaválljejumiid birra ságastallan.
nob: samisk synlig i alle arenaer bla. skilt, tekster, titler;

source: Mánáid gielladáidu, giellageavaheapmi ja oahppanjoksosat fertejit árvvoštallojuvvot jeavddalaččat.
nob: samtaler om språk og språkvalg. Barnas språkferdigheter, språkbruk og læringsutbytte må vurderes jevnlig.

source: Bargovugiid ferte heivehit, jus čájehuvvo, ahte mánáidgárddi dahje skuvlla doaimmat eai olle ulbmiliidda, nappo mánáid produktiivvalaš sámegielatvuhtii.
nob: Arbeidsformene må tilpasses hvis det viser seg at barnehagens eller skolens aktiviteter ikke fører til måloppnåelse, altså at barn blir produktivt samiskspråklige.

source: Árvvoštallama várás galget huksejuvvot oktasaš, riikka dási rámmat ja konkrehtalaš bargoneavvut.
nob: Det må opprettes felles nasjonale rammer og konkrete arbeidsverktøy for evaluering av språktilbud.

source: Bargojoavkku nuppi dokumeanttas mii guorahallat vuđoleappot diđolaš giellageavadagaid ja árvvoštallama, seammás go čilget muhtun bargovugiid mat daidda laktásit.
nob: I arbeidsgruppens andre dokument beskriver både bevisste språkpraksiser og vurdering nærmere, samtidig som vi forklarer noen mulige arbeidsformer.

source: Todal ja Baker modeallain geavahuvvojit obbalaš doahpagat minoritehta- ja majoritehtagiella , go seammá modeallat soitet dieđusge geavahuvvot gos beare máilmmis.
nob: I Todals ja Bakers modeller brukes de generelle begrepene minoritets- og majoritetsspråk , fordi det selvfølgelig er mulig at de samme modellene brukes hvor som helst i verden.

source: Mii leat iežamet ovdanbuktimis sámáidahttán dáid giellamodeallaid, nappo hupmu lea sámegielas ja riikkagielas, vai šaddá čielgaseabbon, maid 9 iešguhtege modealla mearkkaša sámi konteavsttas.
nob: Vi har i vårt framlegg samifisert språkmodellen, det er altså snakk om samisk og riksspråket, slik at det er tydelig hva de forskjellige modellene betyr i samisk kontekst.

source: Sámi konteavsttas riikkagiella čujuha dárogillii, suomagillii, ruoŧagillii dahje ruoššagillii.
nob: I samisk kontekst viser riksspråk til norsk, finsk, svensk eller russisk.

source: 4.1 Geahnohis modealla, mii lea anus Sámis
nob: 4.1 Svak modell, som er i bruk i Sápmi

source: Dat lea dat, man Baker gohčoda mainstream bilingual -modeallan, Todal fas gohčoda dan dárogillii framandspråk -modeallan.
nob: Baker (1993) har beskrevet flere svake språkmodeller, men det er bare en som er i bruk i Sápmi nå til dags, nemlig den som Baker kaller mainstream bilingual -modellen. Todal kaller den for framandspråk -modellen på norsk.

source: Bargojoavku lea válljen dan gohčodit goaikkanasmodeallan danne go dainna modeallain sámegiela oassi mánáidgárde- dahje skuvladoaimmain lea unnán, dego goaikkanasat.
nob: Arbeidsgruppen har valgt å kalle den dryppmodellen , fordi med denne modellen inngår samisk som en så liten del av barnehage- eller skoleaktivitetene, akkurat som små drypp her og der.

source: Sámi konteavsttas dat mearkkaša,- ahte olles fálaldat lea riikkagillii, ja sámegiella oahpahuvvo dahje geavahuvvo dušše ráddjejuvvon bottuin.
nob: I samisk kontekst betyr dette at hele tilbudet er på riksspråket, og undervisning på samisk og bruken av samisk bare skjer i begrensede stunder.

source: Sámegiella lea oahpahusa objeaktan: giellaoahpahus dahje giellabottut leat oktii dahje moddii vahkus, muhto giella ii leat iešguđet doaimmaid ja gulahallama gaskaoapmin.
nob: Samisk er objekt for undervisningen: språkopplæringen eller språkstundende skjer en gang eller et par ganger i uken, men samisk er ikke kommunikasjonsspråket.

source: Vaikko ulbmil lea ahte mánná galgá šaddat sámegielagin, de vásáhusat Sámis ja eará unnitlogugiellaservodagain čájehit, ahte dákkár modealla bokte ulbmil ii ollašuva, boađusin lea baicca ráddjejuvvon gielladáidu.
nob: Selv om målet er at barnet skal bli samiskspråklig, så viser erfaringer fra Sápmi og andre minoritetsspråklige samfunn at man ikke når målet gjennom en slik modell, resultatet er i stedet begrensede språkferdigheter.

source: Ii leat jáhkehahtti ahte álgoálggus riikkagielat mánná šaddá sámegielagin goaikkanasmodeallain.
nob: Det er ikke sannsynlig at et barn som i utgangspunktet snakker riksspråket, blir samiskspråklig gjennom dryppmodellen.

source: Servodatulbmila ja duođalaš gielalaš bohtosa gaskkas lea ruossalasvuohta: ulbmil lea máná sámegielatvuohta, muhto geahnohis giellamodealla boađus lea hárve sámegielat mánná.
nob: Det er en uoverensstemmelse mellom samfunnsmålet og det reelle språklige resultatet: Målet er et samiskspråklig barn, men utfallet av svake språkmodeller er sjelden et samiskspråklig barn.

source: Goaikkanasmodealla geavahuvvo maiddái muhtin mánáidgárddiin ja dat gohčoduvvo eatnigielahárjehallamin, mas mánná oažžu gielladoarjaga ráddjejuvvon áiggis.
nob: Dryppmodellen brukes også i noen barnehager, og det kalles da morsmålstrening, der barnet får språkstøtte i et begrenset tidsrom.

source: Mánáid gielladuogáš váikkuha dasa makkár sámegieldáiddu dássái lea vejolaš ollet goaikkanasmodeallain.
nob: Barnets språkbakgrunn påvirker hvilket nivå av samiskferdigheter det er mulig å oppnå med dryppmodellen.

source: Jus mánás lea sámegiella ruovttugiellan, de son dáidá olahit alit gielladáiddu dási go mánná, geas lea riikkagiella ruovttugiellan.
nob: Hvis barnet har samisk som hjemmespråk, da vil hen antakelig nå et høyere språkferdighetsnivå enn et barn som har riksspråket som hjemmespråk.

source: Goittotge lea hui mearkkašahtti, ahte jus mánná ii oaččo oahpahusa sámegillii iešguđet oahppofágain, dušše sámegiela fágan, de su giella ii beasa ovdánit nu movt galggašii ja nu sámegielat mánná maid olaha ráddjejuvvon sámegielatvuođa.
nob: Det må likevel understrekes at dersom barnet kun får undervisning i samisk som fag, og ikke får undervisning på samisk i de enkelte undervisningsfagene, vil hans/hennes språkutvikling ikke nødvendigvis fortsette på en aldersadekvat linje, og også det samisktalende barnet kan oppnå begrenset samiskspråklighet.

source: Duššebeare giellaoahpahusa bokte lea veadjemeahttun ovdánahttit doarvái iešguđet fágaid sátneráju, ja máná gielladáidui sáhttet báhcit ráiggit ja váilevašvuođat.
nob: Kun ved hjelp av språkfagligopplæring er det umulig å utvikle tilstrekkelig ordforråd i de enkelte fagene, og dryppmodellen kan etterlate hull og mangler i barnets språkferdigheter.

source: Goaikkanasmodealla bokte sáhttá riikkagiella šaddá sakka nanut giellan mánás go sámegiella, juogo obbalaččat dahje máŋgga deaŧalaš suorggis, nu ahte mánná ii nagot sámástit muhtun áššiid birra ja bággehallá válljet riikkagiela.
nob: Med dryppmodellen kan riksspråket bli et adskillig sterkere språk hos barnet enn samisk, enten generelt eller på enkelte viktige 8 områder, slik at barnet ikke kan kommunisere på samisk om enkelte ting og blir tvunget til å velge riksspråket.

source: Danin goaikkanasmodealla ii leat buorre dallege jus ruovttugiellan lea sámegiella.
nob: Derfor er dryppmodellen heller ikke gunstig når barnet har samisk som hjemmespråk.

source: Jus sámeservodaga ulbmil leat produktiivvalaš sámegielat mánát, de eat sáhte Sámis goaikkanasmodealla bokte sirdit ja oahpahit sámegiela.
nob: Hvis målet til det samiske samfunnet er produktivt samiskspråklige barn, da kan vi ikke overføre samisk og undervise i samisk ved hjelp av dryppmodellen.

source: Danin ferte guođđit dán giellamodealla ja dan sadjái geavahišgoahtit gievrras giellamodeallaid.
nob: Denne modellen må man gi avkall på og man må i stedet begynne å bruke sterke språkmodeller.

source: Gielaid sajádat
nob: Dryppmodellen

source: Servoda t-ulbmil
nob: Språkenes stilling

source: Gielalaš boađus
nob: Samfunnsmål

source: Riikkagiel at mánná (riikkagiell a ruovttugiellan)
nob: Riksspråklig barn (riksspråket som hjemmespråk)

source: Riikkagiella, muhto sámegiell a ráddjejuvvon bottuin
nob: Riksspråk, men samisk i begrensede stunder

source: Leago ollislaš plána giela hárrái mánáidgárddis ja vuođđooahpahusas?
nob: Finnes det en helhetlig plan for språk i barnehagen og i grunnopplæringen?

source: Leago diđolašvuoh ta giellageavadiid hárrái ja árvvoštallan ?
nob: Er det bevissthet med tanke på språkpraksiser og vurdering?

source: Ráddjejuvv on sámegielatvuoht a;
nob: Begrensede språkkunnska per;

source: reseptiivva laš sámegiela dáidu
nob: reseptiv samiskspråklig

source: Sámegiela t mánná (sámegiell a ruovttugiellan)
nob: Samiskspråklig barn (samisk som hjemmespråk)

source: Riikkagiel la, muhto sámegiell a ráddjejuvvon bottuin
nob: Riksspråk, men samisk i begrensede stunder

source: Leago ollislaš plána giela hárrái mánáidgárddis ja vuođđooahpahu sas?
nob: Finnes det en helhetlig plan for språk i barnehagen og i grunnopplæringen?

source: Ráddjejuvv on sámegielat -vuohta;
nob: Begrensede språkkunnska per;

source: riikkagiella šaddá sakka nanut giellan, obbalaččat dahje máŋgga deaŧalaš suorggis
nob: riksspråket blir adskillig sterkere språk, generelt eller på enkelte viktige områder

source: Mii eat leat oaidnán vejolažžan tabeallas meroštallat oktageardánit goaikkanasmodealla bisttu ja giellageavadiid.
nob: Det har ikke vært mulig å definere varighet og språkpraksis på en enhetlig måte for dryppmodellen.

source: Dávjá lea nu, ahte sámegiela oahpahus ii fállojuvvo systemáhtalaččat máná olles bajásgeassin- ja oahpahanbálgá áiggi, baicce muhtun muttuin dan.
nob: Ofte er det slik at samiskundervisning ikke tilbys systematisk gjennom hele barnets oppdragelses- og utdanningsløp, men bare i deler av det.

source: Dávjá lea maiddái nu, ahte anus eai leat diđolaš giellageavadat, giellafálaldaga bistu lea váilevaš iige fálaldat árvvoštallojuvvo jeavddalaččat.
nob: Ofte er det også slik at bevisste språkpraksiser ikke er i bruk, varigheten på språktilbudet er mangelfullt og tilbudet blir ikke jevnlig evaluert.

source: Lea goittotge áibbas vejolaš ahte bistu ja giellageavadat leat ortnegis.
nob: Det er allikevel fullt mulig at varighet og språkbevissthet er ivaretatt.

source: Sámis lágiduvvo maiddái hui buorre ja gielladiđolaččat plánejuvvon giellaoahpahus.
nob: I Sápmi tilbys det også veldig god og språkbevisst planlagt språkundervisning.

source: Čuolbman lea, ahte ii buorrege sámegiela oahpahus sáhte buvttihit doarvái buriid bohtosiid, jus dat ollašuvvá goaikkanasmodeallain.
nob: Problemstillingen er at ikke engang godt planlagt samiskundervisning kan skape gode nok resultater, hvis undervisningen gjennomføres med dryppmodellen.

source: Sámemánát dárbbašit ollu eambbo giellafálaldaga go goaikkanasmodealla fállá.
nob: Samiske barn trenger et mer omfattende samisktilbud enn dryppmodellen tilbyr.

source: 11 4.3 Gievrras giellamodeallat, mat heivejit oahpahussii Sámis
nob: 4.3 Sterke språkmodeller, som passer til undervisning i Sápmi

source: Bakeris leat guokte gievrras giellamodealla, mat heivejit Sápmái.
nob: Baker beskiver to sterke språkmodeller som passer til Sápmi.

source: 4.4 Nannenmodealla
nob: 9 4.4 Språkenes stilling

source: Servod at-ulbmil Gielalaš boađus
nob: Samisk-språklig barn (samisk som hjemmespråk)

source: Sámegiella oahpahus- ja gulahallangi ellan
nob: Samisk som undervisnigsog kommu- nikasjonsspråk

source: Ollislaš plána giela hárrái mánáidgárddi s ja vuođđooahpa husas
nob: Helhetlig plan for språk i barnehage og grunnopplæring

source: Diđolaš giellageavad at ja giellageavah eami árvvoštallan
nob: Bevisste språkpraksiser og evaluering av språkbruken

source: Produktiivv alaš sámegiela dáidu, njálmmálaš ja čálalaš
nob: Produktive ferdigheter i samisk, muntlig og skriftlig

source: Dá lea modealla, man Baker gohčoda maintenance / heritage language -modeallan ja Todal fas bevarings- og utviklings -modeallan.
nob: Dette er en modell som Baker kaller maintenance / heritage language -modellen og Todal kaller bevarings- og utviklings -modellen.

source: Mii leat válljen nannenmodealla - doahpaga: ulbmilin lea nannet daid sámegielat mánáid sámegiela, geain lea sámegiella ruovttugiellan.
nob: Vi har valgt befestningsmodell -begrepet: formålet er å befeste språkferdighetene hos barn, som har samisk som hjemmespråk.

source: Nannenmodeallas lea sámegiella gulahallama gaskaoapmin.
nob: I befestningsmodellen er samisk kommunikasjonsspråket.

source: Skuvllas dat mearkkaša ahte sámegiella lea fágaid oahpahusgiellan, ja riikkagiella lea geatnegahtton fága.
nob: På skolen betyr dette at samisk er undervisningsspråk i flere fag enn samisk, og at riksspråket er et obligatorisk fag.

source: Servodaga ulbmil lea gievrras sámegielat ja gielalaš boađus galgá leat mánáid produktiivvalaš sámegiela dáidu.
nob: Samfunnets mål er sterke samiske språk og det språklige resultatet skal være barn med produktive samiskferdigheter.

source: Modealla heive bures dakkár guovlluin dahje mánnájoavkkuin, gos mánáin lea sámegiella vuosttašgiellan.
nob: Modellen passer bra i områder eller barnegrupper der barna har samisk som førstespråk.

source: Bargojoavku ávžžuha geavahit nannenmodealla buot guovlluin gos leat ruovttugiellan sámegiela hálli mánát.
nob: Arbeidsgruppen oppfordrer til å bruke befestningsmodellen i alle områder der det er barn som har samisk som hjemmespråk.
